{
    "name": "Titanic Disaster Analysis",
    "version": "0.1",
    "short_description": "Titanic Disaster Analysis using Tensorflow for demonstration of Patra Model Cards.",
    "full_description": "We have trained a ML model using the tensorflow framework to predict profit for Titanic Disaster Analysis dataset. We leverage this data to run the Patra model cards to capture metadata about the model as well as fairness and explainability metrics.",
    "keywords": "titanic, tensorflow, explainability, fairness, patra",
    "author": "Isuru Gamage",
    "input_type": "Tabular",
    "category": "classification",
    "input_data": "https://www.kaggle.com/datasets/monisamir/titanic-disaster-analysis",
    "output_data": "https://github.iu.edu/d2i/dockerhub/tensorflow/titanic_modelv01",
    "foundational_model": "None",
    "citation": "test_citation",
    "ai_model": {
        "name": "Survived prediction tensorflow model",
        "version": "0.1",
        "description": "Census classification problem using Tensorflow Neural Network using the Titanic Disaster Analysis Dataset",
        "owner": "Isuru Gamage",
        "location": "https://github.iu.edu/d2i/sales/tensorflow_model",
        "license": "BSD-3 Clause",
        "framework": "tensorflow",
        "model_type": "dnn",
        "test_accuracy": 0.7597765326499939,
        "inference_labels": "",
        "model_structure": {
            "module": "keras",
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    }
                },
                "layers": [
                    {
                        "module": "keras.layers",
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                7
                            ],
                            "dtype": "float32",
                            "name": "input_layer_1"
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                7
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                64
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                128
                            ]
                        }
                    }
                ],
                "build_input_shape": [
                    7
                ]
            },
            "build_config": {
                "input_shape": [
                    7
                ]
            },
            "compile_config": {
                "optimizer": {
                    "module": "keras.optimizers",
                    "class_name": "Adam",
                    "config": {
                        "name": "adam",
                        "learning_rate": 0.0010000000474974513,
                        "ema_momentum": 0.99,
                        "beta_1": 0.9,
                        "beta_2": 0.999,
                        "epsilon": 1e-07
                    }
                },
                "loss": "binary_crossentropy",
                "metrics": [
                    "accuracy"
                ],
                "steps_per_execution": 1
            }
        },
        "metrics": {
            "Test loss": 0.5103716850280762,
            "Epochs": 100,
            "Batch Size": 32,
            "Optimizer": "Adam",
            "Learning Rate": 0.0001,
            "Input Shape": [
                712,
                7
            ]
        }
    },
    "bias_analysis": {
        "demographic_parity_diff": 0.8073781291172595,
        "equal_odds_difference": 0.8161764705882353
    },
    "xai_analysis": {
        "Sex": 0.22917130293306848,
        "Fare": 0.03816364827681156,
        "SibSp": 0.0355994401332878,
        "Age": 0.03310475386076028,
        "Embarked": 0.020806641032298394,
        "Parch": 0.017466044177256883,
        "Pclass": 0.007474046144811794
    },
    "model_requirements": [
        "absl-py==2.1.0",
        "accelerate==1.0.1",
        "aiohappyeyeballs==2.4.3",
        "aiohttp==3.10.10",
        "aiosignal==1.3.1",
        "amqp==5.2.0",
        "aniso8601==9.0.1",
        "annotated-types==0.7.0",
        "ansible-core==2.17.5",
        "ansible==10.5.0",
        "anyio==4.6.0",
        "appnope==0.1.4",
        "argon2-cffi-bindings==21.2.0",
        "argon2-cffi==23.1.0",
        "arrow==1.3.0",
        "ascii-magic==2.3.0",
        "asttokens==2.4.1",
        "astunparse==1.6.3",
        "async-lru==2.0.4",
        "asyncache==0.3.1",
        "attrs==23.1.0",
        "autocommand==2.2.2",
        "azure-core==1.31.0",
        "azure-storage-blob==12.19.1",
        "babel==2.16.0",
        "backports.tarfile==1.2.0",
        "bcrypt==4.1.2",
        "beautifulsoup4==4.12.3",
        "billiard==4.2.1",
        "bleach==6.1.0",
        "blinker==1.8.2",
        "boto3==1.34.56",
        "botocore==1.34.162",
        "cachetools==5.5.0",
        "celery==5.4.0",
        "certifi==2024.8.30",
        "cffi==1.17.1",
        "charset-normalizer==3.3.2",
        "click-didyoumean==0.3.1",
        "click-plugins==1.1.1",
        "click-repl==0.3.0",
        "click==8.1.7",
        "cloudpickle==3.0.0",
        "colorama==0.4.6",
        "comm==0.2.2",
        "contourpy==1.3.0",
        "cryptography==42.0.8",
        "cycler==0.12.1",
        "cython==3.0.11",
        "dataclasses-json==0.6.7",
        "debugpy==1.8.6",
        "decorator==5.1.1",
        "defusedxml==0.7.1",
        "distlib==0.3.9",
        "distro==1.9.0",
        "dnspython==2.7.0",
        "docker==7.1.0",
        "dynaconf==3.2.6",
        "email-validator==2.2.0",
        "exceptiongroup==1.2.2",
        "executing==2.1.0",
        "fastapi-cli==0.0.5",
        "fastapi==0.111.0",
        "fastjsonschema==2.20.0",
        "filelock==3.16.1",
        "flask-restful==0.3.10",
        "flask-restx==1.3.0",
        "flask==3.0.3",
        "flatbuffers==24.3.25",
        "flower==2.0.1",
        "flwr==1.12.0",
        "fonttools==4.54.1",
        "forbiddenfruit==0.1.4",
        "fqdn==1.5.1",
        "frozenlist==1.4.1",
        "fsspec==2024.9.0",
        "funkify==0.4.5",
        "gast==0.6.0",
        "gensim==4.3.3",
        "gevent==23.9.1",
        "gitdb==4.0.11",
        "gitpython==3.1.43",
        "google-ai-generativelanguage==0.6.10",
        "google-api-core==2.21.0",
        "google-api-python-client==2.149.0",
        "google-auth-httplib2==0.2.0",
        "google-auth==2.35.0",
        "google-generativeai==0.8.3",
        "google-pasta==0.2.0",
        "google-search-results==2.4.2",
        "googleapis-common-protos==1.65.0",
        "greenlet==3.1.1",
        "grpcio-status==1.67.0",
        "grpcio==1.67.0",
        "h11==0.14.0",
        "h5py==3.12.1",
        "hagrid==0.3.124",
        "httpcore==1.0.6",
        "httplib2==0.22.0",
        "httptools==0.6.4",
        "httpx==0.27.2",
        "huggingface-hub==0.25.1",
        "humanize==4.11.0",
        "idna==3.10",
        "importlib-metadata==8.0.0",
        "importlib-resources==6.4.5",
        "inflect==7.3.1",
        "ipykernel==6.29.5",
        "ipython==8.26.0",
        "ipywidgets==8.1.2",
        "isodate==0.7.2",
        "isoduration==20.11.0",
        "itables==1.7.1",
        "iterators==0.0.2",
        "itsdangerous==2.2.0",
        "jaraco.collections==5.1.0",
        "jaraco.context==5.3.0",
        "jaraco.functools==4.0.1",
        "jaraco.text==3.12.1",
        "jedi==0.19.1",
        "jinja2==3.1.4",
        "jiter==0.6.1",
        "jmespath==1.0.1",
        "joblib==1.4.2",
        "json5==0.9.25",
        "jsonpatch==1.33",
        "jsonpointer==3.0.0",
        "jsonschema-specifications==2023.12.1",
        "jsonschema==4.18.6",
        "jupyter-client==8.6.3",
        "jupyter-core==5.7.2",
        "jupyter-events==0.10.0",
        "jupyter-lsp==2.2.5",
        "jupyter-server-terminals==0.5.3",
        "jupyter-server==2.14.2",
        "jupyterlab-pygments==0.3.0",
        "jupyterlab-server==2.27.3",
        "jupyterlab-widgets==3.0.13",
        "jupyterlab==4.2.5",
        "keras==3.6.0",
        "kiwisolver==1.4.7",
        "kombu==5.4.2",
        "kr8s==0.13.5",
        "langchain-community==0.3.2",
        "langchain-core==0.3.12",
        "langchain-google-genai==2.0.1",
        "langchain-openai==0.2.2",
        "langchain-text-splitters==0.3.0",
        "langchain==0.3.3",
        "langsmith==0.1.135",
        "libclang==18.1.1",
        "llvmlite==0.43.0",
        "lxml==5.3.0",
        "markdown-it-py==3.0.0",
        "markdown==3.5.2",
        "markupsafe==2.1.5",
        "marshmallow==3.22.0",
        "matplotlib-inline==0.1.7",
        "matplotlib==3.9.0",
        "mdurl==0.1.2",
        "mistune==3.0.2",
        "ml-dtypes==0.4.1",
        "more-itertools==10.3.0",
        "mpmath==1.3.0",
        "multidict==6.1.0",
        "mypy-extensions==1.0.0",
        "names==0.3.0",
        "namex==0.0.8",
        "nbclient==0.10.0",
        "nbconvert==7.16.4",
        "nbformat==5.10.4",
        "neo4j==5.25.0",
        "nest-asyncio==1.6.0",
        "networkx==2.8.8",
        "nh3==0.2.17",
        "nltk==3.9.1",
        "node2vec==0.4.6",
        "notebook-shim==0.2.4",
        "notebook==7.2.2",
        "numba==0.60.0",
        "numpy==1.24.4",
        "openai==1.52.0",
        "opt-einsum==3.4.0",
        "optree==0.13.0",
        "orjson==3.10.7",
        "overrides==7.7.0",
        "packaging==24.1",
        "pandas==2.2.2",
        "pandocfilters==1.5.1",
        "paramiko==3.5.0",
        "parso==0.8.4",
        "pathspec==0.12.1",
        "pexpect==4.9.0",
        "pillow==11.0.0",
        "pip==24.2",
        "platformdirs==4.3.6",
        "portalocker==2.10.1",
        "prometheus-client==0.21.0",
        "prompt-toolkit==3.0.48",
        "propcache==0.2.0",
        "proto-plus==1.24.0",
        "protobuf==4.25.5",
        "psutil==6.0.0",
        "psycopg-binary==3.1.19",
        "psycopg-pool==3.2.3",
        "psycopg2-binary==2.9.9",
        "psycopg==3.1.19",
        "ptyprocess==0.7.0",
        "pure-eval==0.2.3",
        "pyarrow==15.0.0",
        "pyasn1-modules==0.4.1",
        "pyasn1==0.6.1",
        "pycapnp==2.0.0",
        "pycparser==2.22",
        "pycryptodome==3.21.0",
        "pydantic-core==2.16.1",
        "pydantic-settings==2.2.1",
        "pydantic==2.6.0",
        "pygments==2.18.0",
        "pymongo==4.6.3",
        "pynacl==1.5.0",
        "pyopenssl==24.2.1",
        "pyparsing==3.2.0",
        "pyrsistent==0.19.3",
        "pysftp==0.2.3",
        "python-box==7.2.0",
        "python-dateutil==2.9.0.post0",
        "python-dotenv==1.0.1",
        "python-json-logger==2.0.7",
        "python-jsonpath==1.2.0",
        "python-multipart==0.0.12",
        "pytz==2024.2",
        "pyyaml==6.0.1",
        "pyzmq==25.1.1",
        "referencing==0.35.1",
        "regex==2024.9.11",
        "requests-toolbelt==1.0.0",
        "requests==2.32.3",
        "requires==0.10.5",
        "resolvelib==1.0.1",
        "restrictedpython==7.0",
        "rfc3339-validator==0.1.4",
        "rfc3986-validator==0.1.1",
        "rich==13.7.1",
        "rogue==0.0.2",
        "rouge==1.0.1",
        "rpds-py==0.20.0",
        "rsa==4.9",
        "s3transfer==0.10.3",
        "sacrebleu==2.4.3",
        "safetensors==0.4.5",
        "scikit-learn==1.5.2",
        "scipy==1.12.0",
        "send2trash==1.8.3",
        "setuptools==75.2.0",
        "shellingham==1.5.4",
        "sherlock==0.4.1",
        "six==1.16.0",
        "slicer==0.0.8",
        "smart-open==7.0.5",
        "smmap==5.0.1",
        "sniffio==1.3.1",
        "soupsieve==2.6",
        "sqlalchemy==2.0.32",
        "stack-data==0.6.3",
        "starlette==0.37.2",
        "syft==0.9.1",
        "sympy==1.13.1",
        "tabulate==0.9.0",
        "tenacity==8.3.0",
        "tensorboard-data-server==0.7.2",
        "tensorboard==2.17.1",
        "tensorflow-io-gcs-filesystem==0.37.1",
        "tensorflow==2.17.0",
        "termcolor==2.5.0",
        "terminado==0.18.1",
        "tf-keras==2.17.0",
        "threadpoolctl==3.5.0",
        "tiktoken==0.8.0",
        "tinycss2==1.3.0",
        "tokenizers==0.20.1",
        "tomli-w==1.0.0",
        "tomli==2.0.1",
        "torch==2.5.0",
        "torchvision==0.20.0",
        "tornado==6.4.1",
        "tqdm==4.66.4",
        "traitlets==5.14.3",
        "transformers==4.45.2",
        "typeguard==4.1.5",
        "typer==0.12.5",
        "types-python-dateutil==2.9.0.20241003",
        "typing-extensions==4.12.0",
        "typing-inspect==0.9.0",
        "tzdata==2024.2",
        "ucimlrepo==0.0.7",
        "ujson==5.10.0",
        "uri-template==1.3.0",
        "uritemplate==4.1.1",
        "urllib3==2.2.3",
        "utils==1.0.2",
        "uvicorn==0.30.0",
        "uvloop==0.21.0",
        "vine==5.1.0",
        "virtualenv-api==2.1.18",
        "virtualenv==20.27.0",
        "watchfiles==0.24.0",
        "wcwidth==0.2.13",
        "webcolors==24.8.0",
        "webencodings==0.5.1",
        "websocket-client==1.8.0",
        "websockets==13.1",
        "werkzeug==3.0.4",
        "wheel==0.44.0",
        "widgetsnbextension==4.0.13",
        "wrapt==1.16.0",
        "xtyping==0.8.2",
        "yarl==1.15.3",
        "zipp==3.19.2",
        "zope.event==5.0",
        "zope.interface==7.1.1"
    ],
    "id": "1b9e2ce1b346f4c2084c35f78543c591db132696d274ed924423e92fdbe6a65a"
}