{
    "name": "UCI Adult Data Analysis model using Tensorflow",
    "version": "0.1",
    "short_description": "UCI Adult Data analysis using Tensorflow for demonstration of Patra Model Cards.",
    "full_description": "We have trained a ML model using the tensorflow framework to predict income for the UCI Adult Dataset. We leverage this data to run the Patra model cards to capture metadata about the model as well as fairness and explainability metrics.",
    "keywords": "uci adult, tensorflow, explainability, fairness, patra",
    "author": "Sachith Withana",
    "input_type": "Tabular",
    "category": "classification",
    "input_data": "https://archive.ics.uci.edu/dataset/2/adult",
    "output_data": "https://github.iu.edu/d2i/dockerhub/tensorflow/adult_modelv01",
    "foundational_model": "None",
    "ai_model": {
        "name": "Income prediction tensorflow model",
        "version": "0.1",
        "description": "Census classification problem using Tensorflow Neural Network using the UCI Adult Dataset",
        "owner": "Sachith Withana",
        "location": "https://github.iu.edu/d2i/uci_adult/tensorflow_model",
        "license": "BSD-3 Clause",
        "framework": "tensorflow",
        "model_type": "dnn",
        "test_accuracy": 0.7635498046875,
        "model_structure": {
            "module": "keras",
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    }
                },
                "layers": [
                    {
                        "module": "keras.layers",
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                100
                            ],
                            "dtype": "float32",
                            "name": "input_layer"
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                100
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                64
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                128
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                64
                            ]
                        }
                    }
                ],
                "build_input_shape": [
                    100
                ]
            },
            "build_config": {
                "input_shape": [
                    100
                ]
            },
            "compile_config": {
                "optimizer": {
                    "module": "keras.optimizers",
                    "class_name": "Adam",
                    "config": {
                        "name": "adam",
                        "learning_rate": 0.0010000000474974513,
                        "ema_momentum": 0.99,
                        "beta_1": 0.9,
                        "beta_2": 0.999,
                        "epsilon": 1e-07
                    }
                },
                "loss": "binary_crossentropy",
                "metrics": [
                    "accuracy"
                ],
                "steps_per_execution": 1
            }
        },
        "metrics": {
            "Test loss": 0.5456678867340088,
            "Epochs": 100,
            "Batch Size": 32,
            "Optimizer": "Adam",
            "Learning Rate": 0.0001,
            "Input Shape": "(26048, 100)"
        }
    },
    "bias_analysis": {
        "demographic_parity_diff": 0.004273079982098825,
        "equal_odds_difference": 0.0030119902230604893
    },
    "xai_analysis": {
        "workclass__Self_emp_not_inc": 1.1589792042743241e-10,
        "race__White": 1.1589792042743241e-10,
        "education__Bachelors": 1.07619497572801e-10,
        "education__HS_grad": 1.0761949749570219e-10,
        "race__Black": 9.934107510366372e-11,
        "education_num": 9.93410746410708e-11,
        "workclass__Private": 9.934107456397199e-11,
        "workclass__State_gov": 8.278422900890685e-11,
        "sex__Male": 8.278422893180802e-11,
        "martial_status__Married_civ_spouse": 8.278422893180802e-11
    },
    "model_requirements": [
        "absl-py==2.1.0",
        "anyio==4.4.0",
        "appnope==0.1.4",
        "argon2-cffi-bindings==21.2.0",
        "argon2-cffi==23.1.0",
        "arrow==1.3.0",
        "asttokens==2.4.1",
        "astunparse==1.6.3",
        "async-lru==2.0.4",
        "attrs==23.1.0",
        "babel==2.15.0",
        "beautifulsoup4==4.12.3",
        "bleach==6.1.0",
        "certifi==2024.6.2",
        "cffi==1.16.0",
        "charset-normalizer==3.3.2",
        "cloudpickle==3.0.0",
        "comm==0.2.2",
        "debugpy==1.8.1",
        "decorator==5.1.1",
        "defusedxml==0.7.1",
        "exceptiongroup==1.2.1",
        "executing==2.0.1",
        "fastjsonschema==2.20.0",
        "flatbuffers==24.3.25",
        "fqdn==1.5.1",
        "gast==0.6.0",
        "google-pasta==0.2.0",
        "grpcio==1.65.4",
        "h11==0.14.0",
        "h5py==3.11.0",
        "httpcore==1.0.5",
        "httpx==0.27.0",
        "idna==3.7",
        "importlib-metadata==7.2.1",
        "ipykernel==6.29.4",
        "ipython==8.18.1",
        "ipywidgets==8.1.3",
        "isoduration==20.11.0",
        "jedi==0.19.1",
        "jinja2==3.1.4",
        "joblib==1.4.2",
        "json5==0.9.25",
        "jsonpointer==3.0.0",
        "jsonschema-specifications==2023.12.1",
        "jsonschema==4.18.6",
        "jupyter-client==8.6.2",
        "jupyter-console==6.6.3",
        "jupyter-core==5.7.2",
        "jupyter-events==0.10.0",
        "jupyter-lsp==2.2.5",
        "jupyter-server-terminals==0.5.3",
        "jupyter-server==2.14.1",
        "jupyter==1.0.0",
        "jupyterlab-pygments==0.3.0",
        "jupyterlab-server==2.27.2",
        "jupyterlab-widgets==3.0.11",
        "jupyterlab==4.2.2",
        "keras==3.4.1",
        "libclang==18.1.1",
        "llvmlite==0.43.0",
        "markdown-it-py==3.0.0",
        "markdown==3.6",
        "markupsafe==2.1.5",
        "matplotlib-inline==0.1.7",
        "mdurl==0.1.2",
        "mistune==3.0.2",
        "ml-dtypes==0.4.0",
        "namex==0.0.8",
        "nbclient==0.10.0",
        "nbconvert==7.16.4",
        "nbformat==5.10.4",
        "nest-asyncio==1.6.0",
        "notebook-shim==0.2.4",
        "notebook==7.2.1",
        "numba==0.60.0",
        "numpy==1.26.4",
        "opt-einsum==3.3.0",
        "optree==0.12.1",
        "overrides==7.7.0",
        "packaging==24.1",
        "pandas==2.2.2",
        "pandocfilters==1.5.1",
        "parso==0.8.4",
        "pexpect==4.9.0",
        "pip==21.3.1",
        "platformdirs==4.2.2",
        "prometheus-client==0.20.0",
        "prompt-toolkit==3.0.47",
        "protobuf==4.25.4",
        "psutil==6.0.0",
        "ptyprocess==0.7.0",
        "pure-eval==0.2.2",
        "pycparser==2.22",
        "pygments==2.18.0",
        "pyrsistent==0.19.3",
        "python-dateutil==2.9.0.post0",
        "python-json-logger==2.0.7",
        "pytz==2024.1",
        "pyyaml==6.0.1",
        "pyzmq==26.0.3",
        "qtconsole==5.5.2",
        "qtpy==2.4.1",
        "referencing==0.35.1",
        "requests==2.32.3",
        "rfc3339-validator==0.1.4",
        "rfc3986-validator==0.1.1",
        "rich==13.7.1",
        "rpds-py==0.18.1",
        "scikit-learn==1.5.0",
        "scipy==1.13.1",
        "send2trash==1.8.3",
        "setuptools==60.2.0",
        "six==1.16.0",
        "slicer==0.0.8",
        "sniffio==1.3.1",
        "soupsieve==2.5",
        "stack-data==0.6.3",
        "tensorboard-data-server==0.7.2",
        "tensorboard==2.17.0",
        "tensorflow-io-gcs-filesystem==0.37.1",
        "tensorflow==2.17.0",
        "termcolor==2.4.0",
        "terminado==0.18.1",
        "threadpoolctl==3.5.0",
        "tinycss2==1.3.0",
        "tomli==2.0.1",
        "tornado==6.4.1",
        "tqdm==4.66.4",
        "traitlets==5.14.3",
        "types-python-dateutil==2.9.0.20240316",
        "typing-extensions==4.12.2",
        "tzdata==2024.1",
        "uri-template==1.3.0",
        "urllib3==2.2.2",
        "wcwidth==0.2.13",
        "webcolors==24.6.0",
        "webencodings==0.5.1",
        "websocket-client==1.8.0",
        "werkzeug==3.0.3",
        "wheel==0.37.1",
        "widgetsnbextension==4.0.11",
        "wrapt==1.16.0",
        "zipp==3.19.2"
    ],
        "id": "1b9e2ce1b376f4c2084c35f78543c591db132696d274ed924423e92fdbe6a64c"
}